using System;
using System.Collections.Generic;
using System.Linq;
using System.Web;

namespace HerbMagicWebApi.Common.WordTemplate
{
    public class 腳色
    {

        public static Dictionary<string, string> 建立三八名單()
        {
            Dictionary<string, string> 聖聖名單 = new Dictionary<string, string>();

            //聖聖名單["丁滿"] = "悠哉";
            //聖聖名單["截圖"] = "範圍:威嚇性武器之一，造成他人不寒而慄，屬低級行為";
            //聖聖名單["那隻豬"] = "頭大，膽子小，興趣大便不擦屁股，練髒污流";
            //聖聖名單["永焱"] = "手速超快單身到現在追求賢大人中，希望解除單身狗狀態";
            //聖聖名單["永炎"] = "手速超快單身到現在追求賢大人中，希望解除單身狗狀態";
            //聖聖名單["妖豔賤貨"] = "絕代佳人，美麗的女人，最近生病中";
            //聖聖名單["高芳"] = "移花美人:年18(過兩星期)，身材姣好32G 希望碰到有緣人";
            //聖聖名單["幻天堂"] = "高雄人 ，有一個15歲的女兒，有房產，外號岳父大人";
            //聖聖名單["熊仔"] = "現任水精靈團長\r\n非官方勸敗工讀生";
            //聖聖名單["風滿樓"] = "移花宮第一高手\r\n經常派清涼圖作團員福利";
            //聖聖名單["樓哥"] = "移花宮第一高手\r\n經常派清涼圖作團員福利";
            //聖聖名單["跑車"] = "移花宮團員\r\n人稱移花鄭伊健\r\n全軍團最快(?)的男人\r\n勸敗組組長";
            //聖聖名單["瑪莎拉蒂"] = "移花宮團員\r\n人稱移花鄭伊健\r\n全軍團最快(?)的男人\r\n勸敗組組長";
            //聖聖名單["十五絕"] = "前聖殿成員\r\n\r\n一早已逃往聖殿小號團十八禁\r\n擅長含血噴人捩橫折曲";


            return 聖聖名單;
        }
        public static Dictionary<string, string> 建立聖聖名單()
        {
            Dictionary<string, string> 聖聖名單 = new Dictionary<string, string>();

            ////聖聖名單["今晚打老虎"] = "現任聖殿團長\r\n熊仔及喬松專用沙包";
            //聖聖名單["香奈兒"] = "聖殿高層\r\n疑似女性玩家（未能證實）已棄S38服\r\n改名趙子龍";
            //聖聖名單["五姑娘"] = "聖殿夜間拆塔戰神";
            //聖聖名單["han9"] = "高V老虎小號(現為聖殿公廁號)";
            //聖聖名單["反骨龍"] = "同為老虎小號(但是現在已經不夠戰力打塔 徹底資源號)";
            //聖聖名單["趙子龍"] = "聖殿夜間拆塔戰神 現為聖聖副團 另一個為羿雪";
            //聖聖名單["熊出沒"] = "聖殿希望 紅馬課好課滿 二隊有馬";
            //聖聖名單["萌小喬"] = "賣了吳國的號，去聖殿討了白天雪的號，經常在世頻寫長文";
            //聖聖名單["38服玩家萌小喬"] = "賣了吳國的號，去聖殿討了白天雪的號，經常在世頻寫長文";
            //聖聖名單["小喬"] = "賣了吳國的號，去聖殿討了白天雪的號，經常在世頻寫長文";
            //聖聖名單["布袋和尚"] = "車礦大功臣 假和尚一個";
            //聖聖名單["九九帝王神功"] = "車礦努力大臣";
            ////聖聖名單["聖誕節"] = "資源商（微信名字是大雪）兼聖殿創團元老 \r\n主要負責洗團員課金，賣資源及洗進口袋\r\n後來倒台後下落不明\r\n傳說去了別服繼續行騙";
            //聖聖名單["彈頭"] = "激進派副團長 據說許多事情是她的意思  已棄服";
            //聖聖名單["修遠"] = "腦筋很厲害的一個狠腳色 第一個不講古談判專家";
            //聖聖名單["武洋"] = "天天缺功勳的狗 ";
            //聖聖名單["笠符"] = "餘無缺老龍團團員 帶著龍團的經驗跟思想去說服聖殿據說是聖誕節";
            //聖聖名單["聖殿團長"] = "演員極惡，阿伯";
            //聖聖名單["tc"] = "主號聖殿的花開彼岸天，小號遍及三國各地\r\n舉凡吞食 三國中毒中 醉生夢死都有 而且都是團長，現在轉移到十八禁\r\n然後發生事情的時候他都在睡覺\r\n任何事情都是他就是在睡覺\r\n估計澳洲的時差跟台灣是12小時";
            //聖聖名單["東老闆"] = "喬姊故事中的主角 \r\n還有賣郡事件\r\n現在加入吞食\r\n前一陣子是副團可是現在不是\r\n現在非常低調";
            //聖聖名單["小黑"] = "傲慢入門大弟子，現在以回聖殿，從此分道揚鑣";
            //聖聖名單["雄"] = "已賣號--思念";
            //// 聖聖名單["神蝦"] = "已棄 但是有新號";
            ////聖聖名單["靠腦袋"] = "33兄弟之一，淫亂之首\r\n能為任何女人兩肋插刀\r\n是隱藏版的高手高高手\r\n成名句:有輸過沒怕過";
            //聖聖名單["真田赤備"] = "傲慢入門大弟子，現在以回聖殿，從此分道揚鑣  56升57花了三個月";
            //聖聖名單["羿雪"] = "Rick三國志 談判第一句就是你要賠償所有失去的 地位定義上好像有點問題";
            //聖聖名單["你就是你"] = "別名放鬆哥  據說20服玩家 來這裡只是車礦跟嘴砲人的";
            //聖聖名單["瘋狂菇菇"] = "板橋人，聖殿神風隊，已加入狂龍";
            //聖聖名單["洪七公"] = "射鵰三部曲中，行俠仗義擊殺200多個壞人從沒殺錯好人，九指神丐";
            //聖聖名單["北丐洪七公"] = "38三部曲中，只會嘴，聖殿坦克";
            //聖聖名單["終結無霜"] = "一群國小";
            //聖聖名單["合團"] = "之前有談過40 /40 但是已經失敗，龍團只有10個人+70小號沒資格跟聖殿合團";

            return 聖聖名單;
        }

        public static Dictionary<string, string> 建立龍龍名單()
        {
            Dictionary<string, string> 龍龍名單 = new Dictionary<string, string>();
            //龍龍名單["狂龍"] = "與水花等聯合成為丐幫，聖殿稱呼為反骨，就如同蔣總統稱中共一樣，聖殿稱之為空殼軍團10高戰+70小號";
            //龍龍名單["水精靈"] = "伊布進化型 現為38服最高戰力 TC稱之為有霸服野心 就像當時的聖殿一樣";
            //龍龍名單["移花宮"] = "吳國高戰聚集地 丐幫盟友 前幾天與聖殿展開激烈大戰 可惜落敗";
            //龍龍名單["贏天"] = "高智商團長，龍團最高戰力，絕招狗喝水";
            //龍龍名單["傲慢"] = "嘴50，龍團軍師，戰力調度戰力支配者，包含世頻國頻戰力";
            //龍龍名單["滿漢全席"] = "諸葛大砲，龍團戰神，車繁榮四千超痛";
            //龍龍名單["滿漢"] = "諸葛大砲，龍團戰神，車繁榮四千超痛";
            //龍龍名單["莫問"] = "南蠻王 現給染使用為染的最強號，有扇子";
            //龍龍名單["染妹"] = "過去不勸敗，現在信用卡無雙，有眾多變強資訊";
            //龍龍名單["神妹"] = "傲氏家族，副業可能心理醫生，陪大家進行心理諮商";
            //龍龍名單["傲慢妹"] = "傲氏家族，副業可能心理醫生，陪大家進行心理諮商";
            //龍龍名單["蕭"] = "溫柔男子，被小橋拒絕，死纏爛打妖豔，現實生活幸福美滿，每天三點麥當勞";
            //龍龍名單["傲嬌"] = "溫柔男子，被小橋拒絕，死纏爛打妖豔，現實生活幸福美滿，每天三點麥當勞";
            //龍龍名單["jimmy"] = "金牌打手，有三個小孩家庭幸福，號給了翁月 YA";
            //龍龍名單["翁月"] = "戰力40萬死不上去，興趣是跳內圈被打，已回歸主人";
            //龍龍名單["念"] = "苗栗高爾夫球教練，最近要有第二個孩子了";
            return 龍龍名單;
        }
    }
}